//
//  SubwayStation.swift
//  Hatcha
//
//  Created by Jung Hwan Park on 2022/01/05.
//

import Foundation

struct Subway
{
    static let stations: [String: [String]] =
    [
        "09호선": ["개화", "김포공항", "공항시장", "신방화", "마곡나루", "양천향교", "가양", "증미", "등촌", "염창", "선유도", "당산", "국회의사당", "여의도", "샛강", "노량진", "노들", "흑석", "동작", "구반포", "신반포", "고속터미널", "사평", "신논현", "언주", "선정릉", "신목동", "삼성중앙", "봉은사", "종합운동장", "삼전", "석촌고분", "석촌", "송파나루", "한성백제", "올림픽공원", "둔촌오륜", "중앙보훈병원"],
        "02호선": ["서울대입구", "아현", "봉천", "신림", "용답", "신대방", "도림천", "신당", "당산", "선릉", "합정", "양천구청", "홍대입구", "신답", "구로디지털단지", "역삼", "상왕십리", "대림", "신도림", "문래", "영등포구청", "신촌", "이대", "신정네거리", "용두", "왕십리", "한양대", "뚝섬", "성수", "건대입구", "구의", "강변", "잠실나루", "잠실", "잠실새내", "종합운동장", "삼성", "강남", "교대", "서초", "방배", "사당", "낙성대", "까치산", "시청", "을지로입구", "을지로3가", "을지로4가", "동대문역사문화공원", "신설동", "충정로"],
        "03호선": ["지축", "충무로", "매봉", "가락시장", "구파발", "일원", "잠원", "대치", "경찰병원", "화정", "대곡", "백석", "마두", "정발산", "주엽", "홍제", "독립문", "동대입구", "학여울", "오금", "경복궁", "도곡", "수서", "연신내", "남부터미널", "안국", "양재", "대청", "고속터미널", "교대", "불광", "녹번", "무악재", "종로3가", "을지로3가", "금호", "옥수", "압구정", "약수", "신사", "원당", "원흥", "삼송", "대화"],
        "경춘선": ["청량리", "상봉", "망우", "신내", "별내", "퇴계원", "사릉", "금곡", "평내호평", "천마산", "마석", "대성리", "청평", "상천", "굴봉산", "백양리", "강촌", "남춘천", "춘천", "중랑", "김유정", "갈매", "가평", "회기", "광운대"],
        "수인분당선": ["개포동", "한대앞", "안산", "정왕", "청량리", "서울숲", "압구정로데오", "강남구청", "선정릉", "가천대", "태평", "복정", "모란", "야탑", "서현", "수내", "오리", "기흥", "상갈", "영통", "매탄권선", "매교", "어천", "야목", "달월", "소래포구", "인천논현", "남동인더스파크", "송도", "숭의", "신포", "인천", "대모산입구", "왕십리", "선릉", "도곡", "수서", "구룡", "중앙", "초지", "신길온천", "수원", "한티", "보정", "망포", "오목천", "미금", "호구포", "이매", "인하대", "오이도", "정자", "구성", "수원시청", "원인재", "고잔", "죽전", "신갈", "고색", "월곶", "연수", "청명", "사리"],
        "01호선": ["동묘앞", "노량진", "봉명", "아산", "탕정", "배방", "신창", "대방", "광운대", "구로", "백운", "온수", "방학", "도봉", "망월사", "회룡", "의정부", "녹양", "덕계", "덕정", "동두천중앙", "소사", "동두천", "관악", "화서", "성환", "제물포", "종로5가", "금정", "영등포", "두정", "동인천", "구일", "천안", "부천", "회기", "군포", "광명", "송내", "동암", "인천", "부개", "간석", "녹천", "수원", "세류", "세마", "오산대", "오산", "송탄", "평택지제", "평택", "직산", "개봉", "역곡", "신이문", "가산디지털단지", "금천구청", "석수", "안양", "명학", "의왕", "성균관대", "용산", "외대앞", "석계", "신도림", "창동", "신길", "동대문", "신설동", "제기동", "청량리", "남영", "월계", "오류동", "도원", "쌍용", "병점", "온양온천", "독산", "서동탄", "주안", "서정리", "당정", "부평", "중동", "진위", "도화", "도봉산", "보산", "가능", "양주", "지행", "소요산", "서울역", "시청", "종각", "종로3가"],
        "신분당선": ["광교", "강남", "양재", "양재시민의숲", "청계산입구", "판교", "정자", "미금", "동천", "수지구청", "성복", "상현", "광교중앙"],
        "서해선": ["소사", "소새울", "시흥대야", "신천", "신현", "시흥시청", "시흥능곡", "달미", "선부", "초지", "시우", "원시"],
        "공항철도": ["서울역", "공덕", "홍대입구", "디지털미디어시티", "마곡나루", "김포공항", "계양", "검암", "청라국제도시", "운서", "공항화물청사", "인천공항1터미널", "인천공항2터미널", "영종"],
        "07호선": ["장암", "도봉산", "마들", "노원", "중계", "하계", "태릉입구", "먹골", "중화", "면목", "사가정", "군자", "어린이대공원", "청담", "강남구청", "논현", "반포", "고속터미널", "내방", "남성", "상도", "장승배기", "신대방삼거리", "대림", "남구로", "가산디지털단지", "광명사거리", "천왕", "온수", "부천종합운동장", "신중동", "상동", "삼산체육관", "굴포천", "부평구청", "수락산", "용마산", "숭실대입구", "신풍", "까치울", "부천시청", "공릉", "상봉", "중곡", "뚝섬유원지", "이수", "학동", "철산", "춘의", "산곡", "석남", "건대입구", "보라매"],
        "06호선": ["응암", "역촌", "불광", "독바위", "연신내", "구산", "새절", "증산", "디지털미디어시티", "월드컵경기장", "마포구청", "망원", "상수", "공덕", "효창공원앞", "삼각지", "녹사평", "이태원", "한강진", "버티고개", "약수", "청구", "신당", "동묘앞", "창신", "보문", "안암", "고려대", "월곡", "상월곡", "돌곶이", "석계", "태릉입구", "화랑대", "봉화산", "신내", "광흥창", "대흥", "합정"],
        "경의선": ["한남", "운정", "금촌", "문산", "망우", "용문", "야당", "금릉", "월롱", "임진강", "양원", "지평", "옥수", "구리", "도농", "홍대입구", "이촌", "응봉", "왕십리", "양정", "강매", "백마", "행신", "덕소", "도심", "능곡", "풍산", "국수", "오빈", "양평", "원덕", "서울역", "신촌", "효창공원앞", "공덕", "서강대", "디지털미디어시티", "곡산", "중랑", "상봉", "팔당", "운길산", "양수", "신원", "아신", "대곡", "용산", "회기", "가좌", "서빙고", "청량리", "화전", "일산", "탄현", "파주", "수색"],
        "05호선": ["방화", "김포공항", "마곡", "발산", "화곡", "까치산", "목동", "오목교", "양평", "영등포구청", "영등포시장", "신길", "여의도", "여의나루", "마포", "공덕", "애오개", "충정로", "서대문", "광화문", "종로3가", "을지로4가", "동대문역사문화공원", "신금호", "행당", "왕십리", "마장", "장한평", "군자", "아차산", "광나루", "길동", "굽은다리", "고덕", "상일동", "둔촌동", "올림픽공원", "오금", "개롱", "거여", "마천", "미사", "하남풍산", "하남시청", "신정", "우장산", "천호", "강일", "강동", "개화산", "명일", "방이", "송정", "답십리", "청구", "하남검단산"],
        "08호선": ["암사", "천호", "강동구청", "잠실", "석촌", "송파", "가락시장", "문정", "남한산성입구", "신흥", "수진", "남위례", "장지", "복정", "산성", "단대오거리", "모란", "몽촌토성"],
        "의정부경전철": ["송산", "탑석", "회룡", "범골", "경전철의정부", "의정부시청", "흥선", "의정부중앙", "동오", "새말", "경기도청북부청사", "효자", "곤제", "어룡", "발곡"],
        "김포도시철도": ["양촌", "구래", "마산", "장기", "운양", "걸포북변", "사우", "풍무", "고촌", "김포공항"],
        "경강선": ["판교", "신둔도예촌", "부발", "이매", "삼동", "경기광주", "초월", "곤지암", "이천", "세종대왕릉", "여주"],
        "04호선": ["미아사거리", "충무로", "명동", "선바위", "경마공원", "대공원", "과천", "정부과천청사", "신길온천", "상계", "회현", "사당", "노원", "성신여대입구", "상록수", "창동", "동작", "서울역", "쌍문", "수유", "미아", "한성대입구", "신용산", "이촌", "산본", "인덕원", "대야미", "반월", "한대앞", "고잔", "초지", "오이도", "수리산", "당고개", "남태령", "평촌", "안산", "길음", "동대문역사문화공원", "총신대입구", "동대문", "혜화", "숙대입구", "삼각지", "금정", "정왕", "범계", "중앙"],
        "우이신설경전철": ["북한산우이", "솔밭공원", "4·19민주묘지", "가오리", "화계", "삼양", "삼양사거리", "솔샘", "북한산보국문", "정릉", "성신여대입구", "보문", "신설동"],
        "인천선": ["박촌", "계산", "부평구청", "부평삼거리", "원인재", "동춘", "인천대입구", "센트럴파크", "송도달빛축제공원", "계양", "임학", "경인교대입구", "부평시장", "동수", "문학경기장", "갈산", "간석오거리", "인천시청", "예술회관", "인천터미널", "캠퍼스타운", "테크노파크", "지식정보단지", "국제업무지구", "귤현", "작전", "부평", "신연수", "동막", "선학"],
        "인천2호선": ["검단사거리", "완정", "검암", "검단오류", "왕길", "아시아드경기장", "석남", "가재울", "주안국가산단", "석바위시장", "만수", "남동구청", "인천대공원", "운연", "마전", "인천가좌", "시민공원", "인천시청", "독정", "검바위", "서구청", "가정", "서부여성회관", "주안", "석천사거리", "모래내시장", "가정중앙시장"],
        "용인경전철": ["강남대", "지석", "기흥", "어정", "동백", "초당", "삼가", "시청.용인대", "명지대", "김량장", "전대.에버랜드", "운동장.송담대", "고진", "보평", "둔전"]]
}

